uhnp/src/InformationRegisters/тн_ОграниченияИнтерактивногоДоступа/тн_ОграниченияИнтерактивногоДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ОграниченияИнтерактивногоДоступа</name>
  <comment>№000043466</comment>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ГруппыДоступа/ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыДоступа</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Администраторы</name>
      <description>Администраторы</description>
    </items>
  </predefined>
  <attributes>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.ПрофилиГруппДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <comment>Только для персональных групп доступа</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяГруппаДоступаПоставляемогоПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ВнешниеПользователи</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.ГруппыВнешнихПользователей</types>
        <types>CatalogRef.ГруппыПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыДоступа</name>
    <attributes>
      <name>ВидДоступа</name>
      <comment>Представлен пустой ссылкой основного типа значений</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ВсеРазрешены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияДоступа</name>
    <attributes>
      <name>ВидДоступа</name>
      <comment>Представлен пустой ссылкой основного типа значений</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ВключаяНижестоящие</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/тн_ОграниченияИнтерактивногоДоступа/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Параметры:
//	Форма - форма приложения 
// Проверяет ограничения редактирования формы. При наличии ограничения устанавливает запрт редактирования формы
// Возвращаемое значение:
//	Истина - блокировка установлена, Ложь - не установлена
Функция ПроверитьУстановитьБлокировкуФормы(Форма) Экспорт 
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипыОбрабатываемыхОбъетов = Новый Структура("Справочник,Документ,ПланВидовХарактеристик,ПланСчетов");
	
	ИмяФормы = Форма.ИмяФормы;
	ЭлементыИмениФормы = СтрРазделить(ИмяФормы, ".");
	Если ЭлементыИмениФормы.Количество() < 2 Тогда
		// это не форма объекта
		Возврат Ложь;
	КонецЕсли;
	
	ТипОбъекта	= ЭлементыИмениФормы[0];
	ИмяОбъекта	= ТипОбъекта + "." + ЭлементыИмениФормы[1];
	
	Если Не ТипыОбрабатываемыхОбъетов.Свойство(ТипОбъекта) Тогда
		// такой тип объекта не обрабатывается
		Возврат Ложь;
	КонецЕсли;
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", 		ТекПользователь);
	Запрос.УстановитьПараметр("ТипОбъекта", 		ТипОбъекта);
	Запрос.УстановитьПараметр("ИмяОбъекта", 	 	ИмяОбъекта);
	Запрос.УстановитьПараметр("ИмяФормы", 	 		ИмяФормы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тн_ОграниченияИнтерактивногоДоступа.ИмяОбъекта КАК ИмяОбъекта
	|ПОМЕСТИТЬ ВТ_ОграниченияПользователя
	|ИЗ
	|	РегистрСведений.тн_ОграниченияИнтерактивногоДоступа КАК тн_ОграниченияИнтерактивногоДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ПО тн_ОграниченияИнтерактивногоДоступа.ГруппаДоступа = ГруппыДоступаПользователи.Ссылка
	|ГДЕ
	|	ГруппыДоступаПользователи.Пользователь = &Пользователь
	|	И тн_ОграниченияИнтерактивногоДоступа.Использовать = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""На все"" КАК Ограничение
	|ИЗ
	|	ВТ_ОграниченияПользователя КАК ВТ_ОграниченияПользователя
	|ГДЕ
	|	ВТ_ОграниченияПользователя.ИмяОбъекта = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""По типу объекта""
	|ИЗ
	|	ВТ_ОграниченияПользователя КАК ВТ_ОграниченияПользователя
	|ГДЕ
	|	ВТ_ОграниченияПользователя.ИмяОбъекта = &ТипОбъекта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""По имени объекта""
	|ИЗ
	|	ВТ_ОграниченияПользователя КАК ВТ_ОграниченияПользователя
	|ГДЕ
	|	ВТ_ОграниченияПользователя.ИмяОбъекта = &ИмяОбъекта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""По имени формы объекта""
	|ИЗ
	|	ВТ_ОграниченияПользователя КАК ВТ_ОграниченияПользователя
	|ГДЕ
	|	ВТ_ОграниченияПользователя.ИмяОбъекта = &ИмяФормы";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаблокироватьФорму(Форма);
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаблокироватьФорму(Форма)
	
	Форма.ТолькоПросмотр = Истина;
	
	// блокировка кнопки "Изменить выделенные"
	Для каждого Элемент Из Форма.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы")
			И СтрНайти(НРег(Элемент.Имя), "изменить") > 0 Тогда
			Элемент.Доступность = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
